Конфигурация/DataProcessors/ГрупповоеЗачислениеПогашениеИОбменПаевЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеЗачислениеПогашениеИОбменПаевЗаДень</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяСтоимостьПая</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаСкидок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыПроцентныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВоВременномХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяСуммаПогашенияДляСкидок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяСуммаЗачисленияДляНадбавок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗачисленияПаев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевод</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧерезАгента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерООВП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНадбавки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНадбавкиИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗачислениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПогашенияПаев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧерезАгента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПогашениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбменыПаев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧерезАгента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачисления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачисленияИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗачисления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗачисленияИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗачислениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашенияИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПогашения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПогашенияИзДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПогашениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетнаяСтоимостьПаяВПИФДляОбмена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаевойИнвестиционныйФондДляОбменаПаев</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ИсточникиАнкетИЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИсточникиАнкетИЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ГрупповоеЗачислениеПогашениеИОбменПаевЗаДень/Ext/ObjectModule.bsl
Процедура ЗаполнитьЗачисленияПаев(УстанавливатьФлагФормировать = Истина) Экспорт
	
	ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
	
	Если ЭтотОбъект.СтавкаНадбавки = 0 Тогда
		
		ПараметрыРасчета = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыРасчета);
		
		Если ПараметрыРасчета.ПрименяютсяНадбавкиИСкидки Тогда
			ЭтотОбъект.ПредельнаяСуммаЗачисленияДляНадбавок = ПараметрыРасчета.ПредельнаяСуммаНадбавки;
		КонецЕсли;
				
	КонецЕсли;	
		
	Если ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда	
		 
		 ЭтотОбъект.РасчетнаяСтоимостьПая = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(ЭтотОбъект.Организация, 
												ЭтотОбъект.СчетДоверительногоУправления, 
												Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -2));
	
		
	КонецЕсли;
	
	Если ЭтотОбъект.СтавкаНадбавки = 0 И ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &УстанавливатьФлагФормировать
		|				И ЗачислениеПаев.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Обрабатывать,
		|	ПереводДенежныхСредств.Ссылка КАК Перевод,
		|	ПереводДенежныхСредств.Основание КАК Заявка,
		|	ПереводДенежныхСредств.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика).ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникиАнкетИЗаявок.Агент) КАК ЧерезАгента,
		|	ЗачислениеПаев.Ссылка КАК ЗачислениеПаев,
		|	ЗачислениеПаев.СуммаНадбавки КАК СуммаНадбавкиИзДокумента,
		|	ЗачислениеПаев.Количество КАК КоличествоИзДокумента,
		|	ЗачислениеПаев.Сумма КАК СуммаИзДокумента,
		|	ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика).Пайщик КАК Пайщик,
		|	ПроцессЗачисленияПаев.НомерОтчетаОВозможностиЗачисленияПаев КАК НомерООВП
		|ИЗ
		|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ЗачислениеПаев
		|		ПО (ЗачислениеПаев.Организация = ПереводДенежныхСредств.Организация)
		|			И (ЗачислениеПаев.СчетДоверительногоУправления = ПереводДенежныхСредств.СчетДоверительногоУправления)
		|			И (ЗачислениеПаев.ПоступлениеДенежныхСредств = ПереводДенежныхСредств.Ссылка)
		|			И (НЕ ЗачислениеПаев.ПометкаУдаления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗачислениеПаев КАК ПроцессЗачисленияПаев
		|		ПО ПереводДенежныхСредств.Организация = ПроцессЗачисленияПаев.Организация
		|			И ПереводДенежныхСредств.Основание = ПроцессЗачисленияПаев.ЗаявкаПайщика
		|			И (ПроцессЗачисленияПаев.Стартован)
		|			И (НЕ ПроцессЗачисленияПаев.Завершен)
		|			И (НЕ ПроцессЗачисленияПаев.ПометкаУдаления)
		|			И (ПроцессЗачисленияПаев.ОтветОВозможностиЗачисленияПаев = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев.ПолученОтчетОВозможностиВыдачиПаев))
		|ГДЕ
		|	ПереводДенежныхСредств.Дата МЕЖДУ ПроцессЗачисленияПаев.Дата И &ДатаОкончания
		|	И ПереводДенежныхСредств.Организация = &Организация
		|	И ПереводДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ТИПЗНАЧЕНИЯ(ПереводДенежныхСредств.Основание) = ТИП(Документ.ЗаявкаПайщика)
		|	И НЕ ПереводДенежныхСредств.Основание = ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.)
		|	И &УсловиеНаЗаявкуПайщика
		|	И ПереводДенежныхСредств.Проведен
		|	И ПроцессЗачисленияПаев.НомерОтчетаОВозможностиЗачисленияПаев ЕСТЬ НЕ NULL ");
	
	Запрос.УстановитьПараметр("ДатаНачала",						НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",					КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация",    				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("УстанавливатьФлагФормировать",	УстанавливатьФлагФормировать);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаПайщика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ПереводДенежныхСредств.Основание = &ЗаявкаПайщика");
		Запрос.УстановитьПараметр("ЗаявкаПайщика", ЭтотОбъект.ЗаявкаПайщика);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ИСТИНА");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЭтотОбъект.ЗачисленияПаев.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НадбавкаИКоличество = РаботаСДокументамиКлиентСервер.РассчитатьКоличествоПаевИСуммуНадбавки(
			НоваяСтрока.Сумма,
			ЭтотОбъект.РасчетнаяСтоимостьПая,
			Новый Структура("ПрименяютсяНадбавкиИСкидки, СтавкаНадбавки, ПредельнаяСуммаНадбавки, ЗаявкаЧерезАгента",
				ЭтотОбъект.ПрименяютсяНадбавкиИСкидки,
				ЭтотОбъект.СтавкаНадбавки,
				ЭтотОбъект.ПредельнаяСуммаЗачисленияДляНадбавок,
				НоваяСтрока.ЧерезАгента));
					
		НоваяСтрока.СтоимостьПая	= ЭтотОбъект.РасчетнаяСтоимостьПая
			+ ?(НадбавкаИКоличество.СуммаНадбавки = 0, 0, Окр(ЭтотОбъект.РасчетнаяСтоимостьПая * ЭтотОбъект.СтавкаНадбавки / 100, 2, 1));
		НоваяСтрока.Количество		= НадбавкаИКоличество.Количество;
		НоваяСтрока.СуммаНадбавки	= НадбавкаИКоличество.СуммаНадбавки;
				
		Если ЗначениеЗаполнено(НоваяСтрока.ЗачислениеПаев) Тогда 
			НоваяСтрока.Примечание = ЗаполнитьПримечание(НоваяСтрока, "ЗачислениеПаев");
		КонецЕсли;
				
		НоваяСтрока.Обрабатывать = ?(ПустаяСтрока(НоваяСтрока.Примечание), НоваяСтрока.Обрабатывать, Истина);
		
	КонецЦикла;

КонецПроцедуры

Функция ЗаполнитьПримечание(СтрокаТаблицы, ВидОперации)
	
	Если ВидОперации = "ПогашениеПаев" Тогда
		РеквизитыДляПроверки = СтрРазделить("Сумма,СуммаСкидки,Количество", ",");
	ИначеЕсли ВидОперации = "ЗачислениеПаев" Тогда
		РеквизитыДляПроверки = СтрРазделить("Сумма,СуммаНадбавки,Количество", ",");
	Иначе
		РеквизитыДляПроверки = СтрРазделить("СуммаЗачисления,СуммаПогашения,КоличествоЗачисления,КоличествоПогашения", ",");
	КонецЕсли;	
	
	РеквизитыСОтличиями = Новый Массив;
	Для Каждого ПроверяемыйРеквизит Из РеквизитыДляПроверки Цикл
		
		Если СтрокаТаблицы[ПроверяемыйРеквизит] <> СтрокаТаблицы[ПроверяемыйРеквизит + "ИзДокумента"] Тогда
			РеквизитыСОтличиями.Добавить(ПроверяемыйРеквизит);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(РеквизитыСОтличиями.Количество() > 0,
			"Отличаются значения из документа: " + СтрСоединить(РеквизитыСОтличиями, ","),
			"");
		
КонецФункции

Процедура СформироватьЗачисленияПаев(Отказ = Ложь, ДанныеДляЗагрузкиФайла = Неопределено) Экспорт
	
	СессияСбораСтатистики 	= "";
	ПолноеИмяОбработки 		= "";

	ЗарегистрироватьНачалоСессии(ПолноеИмяОбработки, СессияСбораСтатистики);
	
	Для Каждого СтрокаЗачисленияПаев Из ЭтотОбъект.ЗачисленияПаев Цикл 
		
		Если Не СтрокаЗачисленияПаев.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
		
		СоздатьДокументЗачисленияПаевПоСтроке(СтрокаЗачисленияПаев, Отказ, Ложь, ДанныеДляЗагрузкиФайла);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОбработки, СессияСбораСтатистики);

КонецПроцедуры

Процедура СоздатьДокументЗачисленияПаевПоСтроке(СтрокаЗачисленияПаев, Отказ, ЭтоОбменПаев = Ложь, ДанныеДляЗагрузкиФайла = Неопределено)
	
	Если ЗначениеЗаполнено(СтрокаЗачисленияПаев.ЗачислениеПаев) Тогда
		
		ЗачислениеПаев = СтрокаЗачисленияПаев.ЗачислениеПаев.ПолучитьОбъект();
		
		Если ЗачислениеПаев.ПометкаУдаления Тогда
			Попытка
				ЗачислениеПаев.УстановитьПометкуУдаления(Ложь);	
			Исключение 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ЗачислениеПаев.Ссылка,,, Отказ);
			КонецПопытки;
		КонецЕсли;    		
		
	Иначе
		
		ЗачислениеПаев = Документы.ЗачислениеПаев.СоздатьДокумент();		
		ЗаполнитьЗначенияСвойств(ЗачислениеПаев, ЭтотОбъект);	
		ЗачислениеПаев.ПоступлениеДенежныхСредств = СтрокаЗачисленияПаев.Перевод;
		
		Если ЭтоОбменПаев Тогда
			ЗачислениеПаев.ПаевойИнвестиционныйФонд		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗачисленияПаев.Заявка, "ПаевойИнвестиционныйФондДляОбменаПаев");
			ЗачислениеПаев.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЗачислениеПаев.ПаевойИнвестиционныйФонд, ТекущаяДатаСеанса());
		КонецЕсли;
		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЗачислениеПаев, СтрокаЗачисленияПаев);
	
	ЗачислениеПаев.Дата = ЭтотОбъект.Дата + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса()));
	
	Попытка 
		ЗачислениеПаев.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ДанныеДляЗагрузкиФайла <> Неопределено Тогда
			ДанныеДляЗагрузкиФайла.Вставить("ЗачислениеПаев", ЗачислениеПаев.Ссылка);
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ?(ЗначениеЗаполнено(ЗачислениеПаев.Ссылка), ЗачислениеПаев.Ссылка, Неопределено),,, Отказ);	
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьНачалоСессии(ПолноеИмяОтчета, СессияСбораСтатистики)
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
КонецПроцедуры

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "Дата,Организация,ПаевойИнвестиционныйФонд";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтотОбъект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Процедура ЗаполнитьПогашенияПаев(УстанавливатьФлагФормировать = Истина) Экспорт
	
	ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ШкалаСкидок) Тогда
		
		ПараметрыРасчета = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
		
		Если ПараметрыРасчета.ПрименяютсяНадбавкиИСкидки Тогда
			ЭтотОбъект.ШкалаСкидок							= ПараметрыРасчета.ШкалаСкидок;
			ЭтотОбъект.ПредельнаяСуммаПогашенияДляСкидок	= ПараметрыРасчета.ПредельнаяСумма;
		КонецЕсли;
		
	КонецЕсли;	
		
	Если ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда	
		 
		 ЭтотОбъект.РасчетнаяСтоимостьПая = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(ЭтотОбъект.Организация, 
												ЭтотОбъект.СчетДоверительногоУправления, 
												Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -2));
	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ШкалаСкидок) И ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &УстанавливатьФлагФормировать
		|				И ПогашениеПаев.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Обрабатывать,
		|	ПроцессПогашенияПаев.Основание КАК Заявка,
		|	ПроцессПогашенияПаев.Основание.Количество КАК Количество,
		|	ПроцессПогашенияПаев.Основание.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникиАнкетИЗаявок.Агент) КАК ЧерезАгента,
		|	ПогашениеПаев.Ссылка КАК ПогашениеПаев,
		|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидкиИзДокумента,
		|	ПогашениеПаев.Количество КАК КоличествоИзДокумента,
		|	ПогашениеПаев.Сумма КАК СуммаИзДокумента,
		|	ПроцессПогашенияПаев.Основание.Пайщик КАК Пайщик
		|ИЗ
		|	БизнесПроцесс.ПогашениеПаев КАК ПроцессПогашенияПаев
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПогашениеПаевПартии.Ссылка КАК Ссылка,
		|				СУММА(ПогашениеПаевПартии.СуммаСкидки) КАК СуммаСкидки
		|			ИЗ
		|				Документ.ПогашениеПаев.Партии КАК ПогашениеПаевПартии
		|			ГДЕ
		|				ПогашениеПаевПартии.Ссылка.Организация = &Организация
		|				И ПогашениеПаевПартии.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПогашениеПаевПартии.Ссылка) КАК ВложенныйЗапрос
		|			ПО ПогашениеПаев.Ссылка = ВложенныйЗапрос.Ссылка
		|		ПО (ПогашениеПаев.Организация = ПроцессПогашенияПаев.Организация)
		|			И (ПогашениеПаев.Заявка = ПроцессПогашенияПаев.Основание)
		|			И (НЕ ПогашениеПаев.ПометкаУдаления)
		|			И (ПогашениеПаев.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|ГДЕ
		|	ПроцессПогашенияПаев.Организация = &Организация
		|	И ПроцессПогашенияПаев.Стартован
		|	И НЕ ПроцессПогашенияПаев.Завершен
		|	И НЕ ПроцессПогашенияПаев.ПометкаУдаления
		|	И &УсловиеНаЗаявкуПайщика");
	
	Запрос.УстановитьПараметр("ДатаНачала",						НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",					КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация",    				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("УстанавливатьФлагФормировать",	УстанавливатьФлагФормировать);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаПайщика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ПроцессПогашенияПаев.Основание = &ЗаявкаПайщика");
		Запрос.УстановитьПараметр("ЗаявкаПайщика", ЭтотОбъект.ЗаявкаПайщика);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ИСТИНА");
	КонецЕсли;
	
	ПараметрыСкидок = Новый Структура("ШкалаСкидок, ПредельнаяСумма, ПрименяютсяНадбавкиИСкидки, РасчетнаяСтоимостьПая",
								ЭтотОбъект.ШкалаСкидок,
								ЭтотОбъект.ПредельнаяСуммаПогашенияДляСкидок,
								ЗначениеЗаполнено(ЭтотОбъект.ШкалаСкидок),
								ЭтотОбъект.РасчетнаяСтоимостьПая);
								
	ТекДата = ТекущаяДатаСеанса();
	
	СтруктураДокумента = Новый Структура("Организация, Дата, ПаевойИнвестиционныйФонд",
			ЭтотОбъект.Организация,
			ЭтотОбъект.Дата + (ТекДата - НачалоДня(ТекДата)),
			ЭтотОбъект.ПаевойИнвестиционныйФонд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЭтотОбъект.ПогашенияПаев.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		// Рассчитываем партии для получения текущей суммы скидки
		
		Отказ = Ложь;		
		СтруктураДокумента.Вставить("Пайщик",		Выборка.Пайщик);
		СтруктураДокумента.Вставить("Количество",	Выборка.Количество);
		СтруктураДокумента.Вставить("Заявка",		Выборка.Заявка);
		
		ПартииИСкидки = РаботаСПартиямиДолейПайщиков.РассчитатьПартииИСкидки(СтруктураДокумента, ПараметрыСкидок, Отказ);
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Сумма		= ПартииИСкидки.Итог("СуммаПогашения");
		НоваяСтрока.СуммаСкидки	= ПартииИСкидки.Итог("СуммаСкидки");
						
		Если ЗначениеЗаполнено(НоваяСтрока.ПогашениеПаев) Тогда 
			НоваяСтрока.Примечание = ЗаполнитьПримечание(НоваяСтрока, "ПогашениеПаев");
		КонецЕсли;
				
		НоваяСтрока.Обрабатывать = ?(ПустаяСтрока(НоваяСтрока.Примечание), НоваяСтрока.Обрабатывать, Истина);
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьПогашенияПаев(СтрУведомлениеРегистратора, Отказ = Ложь, ДанныеДляЗагрузкиФайла = Неопределено) Экспорт
	
	СессияСбораСтатистики 	= "";
	ПолноеИмяОбработки 		= "";

	ЗарегистрироватьНачалоСессии(ПолноеИмяОбработки, СессияСбораСтатистики);
	
	Для Каждого СтрокаПогашенияПаев Из ЭтотОбъект.ПогашенияПаев Цикл 
		
		Если Не СтрокаПогашенияПаев.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
		
		СоздатьДокументПогашенияПаевПоСтроке(СтрокаПогашенияПаев, СтрУведомлениеРегистратора, Отказ, Ложь, ДанныеДляЗагрузкиФайла);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОбработки, СессияСбораСтатистики);

КонецПроцедуры

Процедура СформироватьОбменыПаев(СтрУведомлениеРегистратора, Отказ = Ложь, ДанныеДляЗагрузкиФайла = Неопределено) Экспорт
	
	СессияСбораСтатистики 	= "";
	ПолноеИмяОбработки 		= "";

	ЗарегистрироватьНачалоСессии(ПолноеИмяОбработки, СессияСбораСтатистики);
	
	Для Каждого СтрокаОбменыПаев Из ЭтотОбъект.ОбменыПаев Цикл 
		
		Если Не СтрокаОбменыПаев.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		// Нужно передать структуры с правильными именами свойств
		СтрокаПогашенияПаев = Новый Структура("ПогашениеПаев,Заявка,Количество,Сумма",
											СтрокаОбменыПаев.ПогашениеПаев,
											СтрокаОбменыПаев.Заявка,
											СтрокаОбменыПаев.КоличествоПогашения,
											СтрокаОбменыПаев.СуммаПогашения);

		СоздатьДокументПогашенияПаевПоСтроке(СтрокаПогашенияПаев, СтрУведомлениеРегистратора, Отказ, Истина, ДанныеДляЗагрузкиФайла);
		
		Если Отказ Тогда 
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		СтрокаЗачисленияПаев = Новый Структура("ЗачислениеПаев,Заявка,Количество,Сумма, Перевод, Пайщик",
											СтрокаОбменыПаев.ЗачислениеПаев,
											СтрокаОбменыПаев.Заявка,
											СтрокаОбменыПаев.КоличествоЗачисления,
											СтрокаОбменыПаев.СуммаЗачисления,
											Неопределено,
											СтрокаОбменыПаев.Пайщик);
											
		СоздатьДокументЗачисленияПаевПоСтроке(СтрокаЗачисленияПаев, Отказ, Истина, ДанныеДляЗагрузкиФайла);
		
		Если Отказ Тогда
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОбработки, СессияСбораСтатистики);

КонецПроцедуры

Процедура СоздатьДокументПогашенияПаевПоСтроке(СтрокаПогашенияПаев, СтрУведомлениеРегистратора, Отказ, ЭтоОбменПаев = Ложь, ДанныеДляЗагрузкиФайла = Неопределено)
	
	Если ЗначениеЗаполнено(СтрокаПогашенияПаев.ПогашениеПаев) Тогда
		
		ПогашениеПаев = СтрокаПогашенияПаев.ПогашениеПаев.ПолучитьОбъект();
		
		Если ПогашениеПаев.ПометкаУдаления Тогда
			
			Попытка
				ПогашениеПаев.УстановитьПометкуУдаления(Ложь);
			Исключение 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ПогашениеПаев.Ссылка,,, Отказ);
			КонецПопытки;
			
		ИначеЕсли ПогашениеПаев.Проведен Тогда
			
			Попытка
				ПогашениеПаев.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ПогашениеПаев.Ссылка,,, Отказ);
			КонецПопытки;
			
		КонецЕсли;    		
		
	Иначе
		
		ПогашениеПаев = Документы.ПогашениеПаев.СоздатьДокумент();
		ПогашениеПаев.Заполнить(СтрокаПогашенияПаев.Заявка);
		ЗаполнитьЗначенияСвойств(ПогашениеПаев, ЭтотОбъект);	
				
	КонецЕсли; 
	
	ПогашениеПаев.Партии.Очистить();
	
	ЗаполнитьЗначенияСвойств(ПогашениеПаев, СтрокаПогашенияПаев);
	ПогашениеПаев.Основание = СтрУведомлениеРегистратора;
	
	ТекДата = ТекущаяДатаСеанса();
	ПогашениеПаев.Дата = ЭтотОбъект.Дата + (ТекДата - НачалоДня(ТекДата));
	
	ПараметрыСкидок = Новый Структура("ШкалаСкидок, ПредельнаяСумма, ПрименяютсяНадбавкиИСкидки, РасчетнаяСтоимостьПая",
						ЭтотОбъект.ШкалаСкидок,
						ЭтотОбъект.ПредельнаяСуммаПогашенияДляСкидок,
						?(ЭтоОбменПаев, Ложь, ЗначениеЗаполнено(ЭтотОбъект.ШкалаСкидок)),
						ЭтотОбъект.РасчетнаяСтоимостьПая);
						
	РассчитанныеПартии = РаботаСПартиямиДолейПайщиков.РассчитатьПартииИСкидки(ПогашениеПаев, ПараметрыСкидок, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПогашениеПаев.Партии.Загрузить(РассчитанныеПартии);
	ПогашениеПаев.Сумма = ПогашениеПаев.Партии.Итог("СуммаПогашения");
		
	Попытка 
		ПогашениеПаев.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ДанныеДляЗагрузкиФайла <> Неопределено Тогда
			ДанныеДляЗагрузкиФайла.Вставить("ПогашениеПаев", ПогашениеПаев.Ссылка);
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ?(ЗначениеЗаполнено(ПогашениеПаев.Ссылка), ПогашениеПаев.Ссылка, Неопределено),,, Отказ);	
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьОбменыПаев(УстанавливатьФлагФормировать = Истина) Экспорт
	
	ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
			
	Если ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда	
		 
		 ЭтотОбъект.РасчетнаяСтоимостьПая = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(ЭтотОбъект.Организация, 
												ЭтотОбъект.СчетДоверительногоУправления, 
												Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -2));
	
		
	КонецЕсли;
	
	Если ЭтотОбъект.РасчетнаяСтоимостьПая = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &УстанавливатьФлагФормировать
		|				И ПогашениеПаев.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Обрабатывать,
		|	ПроцессОбменаПаев.Основание КАК Заявка,
		|	ПроцессОбменаПаев.Основание.Количество КАК КоличествоПогашения,
		|	ПроцессОбменаПаев.Основание.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникиАнкетИЗаявок.Агент) КАК ЧерезАгента,
		|	ПогашениеПаев.Ссылка КАК ПогашениеПаев,
		|	ПогашениеПаев.Количество КАК КоличествоПогашенияИзДокумента,
		|	ПогашениеПаев.Сумма КАК СуммаПогашенияИзДокумента,
		|	ЗачислениеПаев.Ссылка КАК ЗачислениеПаев,
		|	ЗачислениеПаев.Сумма КАК СуммаЗачисленияИзДокумента,
		|	ЗачислениеПаев.Количество КАК КоличествоЗачисленияИзДокумента,
		|	ПроцессОбменаПаев.Основание.Пайщик КАК Пайщик,
		|	ПроцессОбменаПаев.Основание.ПаевойИнвестиционныйФондДляОбменаПаев КАК ПаевойИнвестиционныйФондДляОбменаПаев
		|ИЗ
		|	БизнесПроцесс.ОбменПаев КАК ПроцессОбменаПаев
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ПО (ПогашениеПаев.Организация = ПроцессОбменаПаев.Организация)
		|			И (ПогашениеПаев.Заявка = ПроцессОбменаПаев.Основание)
		|			И (НЕ ПогашениеПаев.ПометкаУдаления)
		|			И (ПогашениеПаев.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ЗачислениеПаев
		|		ПО (ЗачислениеПаев.Организация = ПроцессОбменаПаев.Организация)
		|			И (ЗачислениеПаев.Заявка = ПроцессОбменаПаев.Основание)
		|			И (НЕ ЗачислениеПаев.ПометкаУдаления)
		|			И (ЗачислениеПаев.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|ГДЕ
		|	ПроцессОбменаПаев.Организация = &Организация
		|	И ПроцессОбменаПаев.Стартован
		|	И НЕ ПроцессОбменаПаев.Завершен
		|	И НЕ ПроцессОбменаПаев.ПометкаУдаления
		|	И &УсловиеНаЗаявкуПайщика");
	
	Запрос.УстановитьПараметр("ДатаНачала",						НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",					КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация",    				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("УстанавливатьФлагФормировать",	УстанавливатьФлагФормировать);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаПайщика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ПроцессОбменаПаев.Основание = &ЗаявкаПайщика");
		Запрос.УстановитьПараметр("ЗаявкаПайщика", ЭтотОбъект.ЗаявкаПайщика);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЗаявкуПайщика", "ИСТИНА");
	КонецЕсли;
	
	ПараметрыСкидок = Новый Структура("ПрименяютсяНадбавкиИСкидки, РасчетнаяСтоимостьПая", Ложь, ЭтотОбъект.РасчетнаяСтоимостьПая);
	ТекДата = ТекущаяДатаСеанса();
	
	СтруктураДокумента = Новый Структура("Организация, Дата, ПаевойИнвестиционныйФонд",
			ЭтотОбъект.Организация,
			ЭтотОбъект.Дата + (ТекДата - НачалоДня(ТекДата)),
			ЭтотОбъект.ПаевойИнвестиционныйФонд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		НоваяСтрока = ЭтотОбъект.ОбменыПаев.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		// У ПИФа для обмена паев нужно получить расчетную стоимость пая		
		СчетДУДляОбменаПаев = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(
								НоваяСтрока.ПаевойИнвестиционныйФондДляОбменаПаев,
								ЭтотОбъект.Дата);
								
		НоваяСтрока.РасчетнаяСтоимостьПаяВПИФДляОбмена = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(
															ЭтотОбъект.Организация,
															СчетДУДляОбменаПаев,
															Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(
																СчетДУДляОбменаПаев,						
																ЭтотОбъект.Дата));
									

		Если НоваяСтрока.РасчетнаяСтоимостьПаяВПИФДляОбмена = 0 Тогда			
			Продолжить;
		КонецЕсли;
		
		Отказ = Ложь;		
		СтруктураДокумента.Вставить("Пайщик",		Выборка.Пайщик);
		СтруктураДокумента.Вставить("Количество",	Выборка.КоличествоПогашения);
		
		ПартииИСкидки = РаботаСПартиямиДолейПайщиков.РассчитатьПартииИСкидки(СтруктураДокумента, ПараметрыСкидок, Отказ);
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.СуммаПогашения	= ПартииИСкидки.Итог("СуммаПогашения");		
		НоваяСтрока.СуммаЗачисления	= НоваяСтрока.СуммаПогашения;
		
		НадбавкаИКоличество = РаботаСДокументамиКлиентСервер.РассчитатьКоличествоПаевИСуммуНадбавки(
			НоваяСтрока.СуммаЗачисления,
			НоваяСтрока.РасчетнаяСтоимостьПаяВПИФДляОбмена,
			Новый Структура("ПрименяютсяНадбавкиИСкидки", Ложь));
					
		НоваяСтрока.КоличествоЗачисления = НадбавкаИКоличество.Количество;

		Если ЗначениеЗаполнено(НоваяСтрока.ПогашениеПаев) Или ЗначениеЗаполнено(НоваяСтрока.ЗачислениеПаев) Тогда 
			НоваяСтрока.Примечание = ЗаполнитьПримечание(НоваяСтрока, "ОбменПаев");
		КонецЕсли;
				
		НоваяСтрока.Обрабатывать = ?(ПустаяСтрока(НоваяСтрока.Примечание), НоваяСтрока.Обрабатывать, Истина);
		
	КонецЦикла;

КонецПроцедуры
